app/controllers/user_details_controller.rb

  def set_user_details
    @user_details = UserDetails.set_user_details(:fb_access_token => params[:fb_access_token])
    if @user_details[:err].blank?
---
SELECT `user_details`.* FROM `user_details` WHERE (username = 'chandan.jhun') LIMIT 1